loadtest/results/2026-08-13/p2_guest_vu1000.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed-guest-step.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 1m30s (gracefulStop: 30s)


running (0m00.5s), 1000/1000 VUs, 39 complete and 0 interrupted iterations
default   [   1% ] 1000 VUs  0m00.5s/1m30s

running (0m01.5s), 1000/1000 VUs, 237 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  0m01.5s/1m30s

running (0m02.5s), 1000/1000 VUs, 440 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m02.5s/1m30s

running (0m03.5s), 1000/1000 VUs, 636 complete and 0 interrupted iterations
default   [   4% ] 1000 VUs  0m03.5s/1m30s

running (0m04.5s), 1000/1000 VUs, 841 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m04.5s/1m30s

running (0m05.5s), 1000/1000 VUs, 1053 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  0m05.5s/1m30s

running (0m06.5s), 1000/1000 VUs, 1268 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  0m06.5s/1m30s

running (0m07.5s), 1000/1000 VUs, 1479 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m07.5s/1m30s

running (0m08.5s), 1000/1000 VUs, 1690 complete and 0 interrupted iterations
default   [   9% ] 1000 VUs  0m08.5s/1m30s

running (0m09.5s), 1000/1000 VUs, 1897 complete and 0 interrupted iterations
default   [  11% ] 1000 VUs  0m09.5s/1m30s

running (0m10.5s), 1000/1000 VUs, 2106 complete and 0 interrupted iterations
default   [  12% ] 1000 VUs  0m10.5s/1m30s

running (0m11.5s), 1000/1000 VUs, 2318 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m11.5s/1m30s

running (0m12.5s), 1000/1000 VUs, 2530 complete and 0 interrupted iterations
default   [  14% ] 1000 VUs  0m12.5s/1m30s

running (0m13.5s), 1000/1000 VUs, 2739 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m13.5s/1m30s

running (0m14.5s), 1000/1000 VUs, 2947 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  0m14.5s/1m30s

running (0m15.5s), 1000/1000 VUs, 3157 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  0m15.5s/1m30s

running (0m16.5s), 1000/1000 VUs, 3367 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m16.5s/1m30s

running (0m17.5s), 1000/1000 VUs, 3581 complete and 0 interrupted iterations
default   [  19% ] 1000 VUs  0m17.5s/1m30s

running (0m18.5s), 1000/1000 VUs, 3794 complete and 0 interrupted iterations
default   [  21% ] 1000 VUs  0m18.5s/1m30s

running (0m19.5s), 1000/1000 VUs, 4005 complete and 0 interrupted iterations
default   [  22% ] 1000 VUs  0m19.5s/1m30s

running (0m20.5s), 1000/1000 VUs, 4221 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m20.5s/1m30s

running (0m21.5s), 1000/1000 VUs, 4438 complete and 0 interrupted iterations
default   [  24% ] 1000 VUs  0m21.5s/1m30s

running (0m22.5s), 1000/1000 VUs, 4655 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m22.5s/1m30s

running (0m23.5s), 1000/1000 VUs, 4873 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  0m23.5s/1m30s

running (0m24.5s), 1000/1000 VUs, 5089 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  0m24.5s/1m30s

running (0m25.5s), 1000/1000 VUs, 5298 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m25.5s/1m30s

running (0m26.5s), 1000/1000 VUs, 5511 complete and 0 interrupted iterations
default   [  29% ] 1000 VUs  0m26.5s/1m30s

running (0m27.5s), 1000/1000 VUs, 5725 complete and 0 interrupted iterations
default   [  31% ] 1000 VUs  0m27.5s/1m30s

running (0m28.5s), 1000/1000 VUs, 5940 complete and 0 interrupted iterations
default   [  32% ] 1000 VUs  0m28.5s/1m30s

running (0m29.5s), 1000/1000 VUs, 6153 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m29.5s/1m30s

running (0m30.5s), 1000/1000 VUs, 6358 complete and 0 interrupted iterations
default   [  34% ] 1000 VUs  0m30.5s/1m30s

running (0m31.5s), 1000/1000 VUs, 6571 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m31.5s/1m30s

running (0m32.5s), 1000/1000 VUs, 6785 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  0m32.5s/1m30s

running (0m33.5s), 1000/1000 VUs, 6997 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  0m33.5s/1m30s

running (0m34.5s), 1000/1000 VUs, 7211 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m34.5s/1m30s

running (0m35.5s), 1000/1000 VUs, 7420 complete and 0 interrupted iterations
default   [  39% ] 1000 VUs  0m35.5s/1m30s

running (0m36.5s), 1000/1000 VUs, 7639 complete and 0 interrupted iterations
default   [  41% ] 1000 VUs  0m36.5s/1m30s

running (0m37.5s), 1000/1000 VUs, 7852 complete and 0 interrupted iterations
default   [  42% ] 1000 VUs  0m37.5s/1m30s

running (0m38.5s), 1000/1000 VUs, 8062 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m38.5s/1m30s

running (0m39.5s), 1000/1000 VUs, 8277 complete and 0 interrupted iterations
default   [  44% ] 1000 VUs  0m39.5s/1m30s

running (0m40.5s), 1000/1000 VUs, 8449 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m40.5s/1m30s

running (0m41.5s), 1000/1000 VUs, 8612 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  0m41.5s/1m30s

running (0m42.5s), 1000/1000 VUs, 8817 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  0m42.5s/1m30s

running (0m43.5s), 1000/1000 VUs, 9026 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m43.5s/1m30s

running (0m44.5s), 1000/1000 VUs, 9238 complete and 0 interrupted iterations
default   [  49% ] 1000 VUs  0m44.5s/1m30s

running (0m45.5s), 1000/1000 VUs, 9444 complete and 0 interrupted iterations
default   [  51% ] 1000 VUs  0m45.5s/1m30s

running (0m46.5s), 1000/1000 VUs, 9627 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  0m46.5s/1m30s

running (0m47.5s), 1000/1000 VUs, 9841 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m47.5s/1m30s

running (0m48.5s), 1000/1000 VUs, 10056 complete and 0 interrupted iterations
default   [  54% ] 1000 VUs  0m48.5s/1m30s

running (0m49.5s), 1000/1000 VUs, 10267 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m49.5s/1m30s

running (0m50.5s), 1000/1000 VUs, 10465 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  0m50.5s/1m30s

running (0m51.5s), 1000/1000 VUs, 10672 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  0m51.5s/1m30s

running (0m52.5s), 1000/1000 VUs, 10880 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m52.5s/1m30s

running (0m53.5s), 1000/1000 VUs, 11095 complete and 0 interrupted iterations
default   [  59% ] 1000 VUs  0m53.5s/1m30s

running (0m54.5s), 1000/1000 VUs, 11299 complete and 0 interrupted iterations
default   [  61% ] 1000 VUs  0m54.5s/1m30s

running (0m55.5s), 1000/1000 VUs, 11517 complete and 0 interrupted iterations
default   [  62% ] 1000 VUs  0m55.5s/1m30s

running (0m56.5s), 1000/1000 VUs, 11727 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m56.5s/1m30s

running (0m57.5s), 1000/1000 VUs, 11946 complete and 0 interrupted iterations
default   [  64% ] 1000 VUs  0m57.5s/1m30s

running (0m58.5s), 1000/1000 VUs, 12161 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m58.5s/1m30s

running (0m59.5s), 1000/1000 VUs, 12374 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  0m59.5s/1m30s

running (1m00.5s), 1000/1000 VUs, 12592 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  1m00.5s/1m30s

running (1m01.5s), 1000/1000 VUs, 12802 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  1m01.5s/1m30s

running (1m02.5s), 1000/1000 VUs, 13018 complete and 0 interrupted iterations
default   [  69% ] 1000 VUs  1m02.5s/1m30s

running (1m03.5s), 1000/1000 VUs, 13235 complete and 0 interrupted iterations
default   [  71% ] 1000 VUs  1m03.5s/1m30s

running (1m04.5s), 1000/1000 VUs, 13456 complete and 0 interrupted iterations
default   [  72% ] 1000 VUs  1m04.5s/1m30s

running (1m05.5s), 1000/1000 VUs, 13677 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  1m05.5s/1m30s

running (1m06.5s), 1000/1000 VUs, 13887 complete and 0 interrupted iterations
default   [  74% ] 1000 VUs  1m06.5s/1m30s

running (1m07.5s), 1000/1000 VUs, 14094 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  1m07.5s/1m30s

running (1m08.5s), 1000/1000 VUs, 14310 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  1m08.5s/1m30s

running (1m09.5s), 1000/1000 VUs, 14527 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  1m09.5s/1m30s

running (1m10.5s), 1000/1000 VUs, 14685 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  1m10.5s/1m30s

running (1m11.5s), 1000/1000 VUs, 14907 complete and 0 interrupted iterations
default   [  79% ] 1000 VUs  1m11.5s/1m30s

running (1m12.5s), 1000/1000 VUs, 15113 complete and 0 interrupted iterations
default   [  81% ] 1000 VUs  1m12.5s/1m30s

running (1m13.5s), 1000/1000 VUs, 15320 complete and 0 interrupted iterations
default   [  82% ] 1000 VUs  1m13.5s/1m30s

running (1m14.5s), 1000/1000 VUs, 15535 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  1m14.5s/1m30s

running (1m15.5s), 1000/1000 VUs, 15752 complete and 0 interrupted iterations
default   [  84% ] 1000 VUs  1m15.5s/1m30s

running (1m16.5s), 1000/1000 VUs, 15970 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  1m16.5s/1m30s

running (1m17.5s), 1000/1000 VUs, 16180 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  1m17.5s/1m30s

running (1m18.5s), 1000/1000 VUs, 16394 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  1m18.5s/1m30s

running (1m19.5s), 1000/1000 VUs, 16600 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  1m19.5s/1m30s

running (1m20.5s), 1000/1000 VUs, 16817 complete and 0 interrupted iterations
default   [  89% ] 1000 VUs  1m20.5s/1m30s

running (1m21.5s), 1000/1000 VUs, 17034 complete and 0 interrupted iterations
default   [  91% ] 1000 VUs  1m21.5s/1m30s

running (1m22.5s), 1000/1000 VUs, 17244 complete and 0 interrupted iterations
default   [  92% ] 1000 VUs  1m22.5s/1m30s

running (1m23.5s), 1000/1000 VUs, 17458 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  1m23.5s/1m30s

running (1m24.5s), 1000/1000 VUs, 17676 complete and 0 interrupted iterations
default   [  94% ] 1000 VUs  1m24.5s/1m30s

running (1m25.5s), 1000/1000 VUs, 17891 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  1m25.5s/1m30s

running (1m26.5s), 1000/1000 VUs, 18107 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  1m26.5s/1m30s

running (1m27.5s), 1000/1000 VUs, 18312 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  1m27.5s/1m30s

running (1m28.5s), 1000/1000 VUs, 18527 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  1m28.5s/1m30s

running (1m29.5s), 1000/1000 VUs, 18745 complete and 0 interrupted iterations
default   [  99% ] 1000 VUs  1m29.5s/1m30s

running (1m30.5s), 0896/1000 VUs, 18965 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m30s

running (1m31.5s), 0673/1000 VUs, 19188 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m30s

running (1m32.5s), 0453/1000 VUs, 19408 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m30s

running (1m33.5s), 0235/1000 VUs, 19626 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m30s

running (1m34.5s), 0007/1000 VUs, 19854 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 39722   420.4625/s
    checks_succeeded...: 100.00% 39722 out of 39722
    checks_failed......: 0.00%   0 out of 39722

    ✓ status 200
    ✓ 본문 있음

    CUSTOM
    feed_guest_duration............: avg=4.63s min=151.24ms med=4.69s p(90)=5.16s p(95)=5.57s p(99)=5.82s max=7.82s

    HTTP
    http_req_duration..............: avg=4.63s min=151.24ms med=4.69s p(90)=5.16s p(95)=5.57s p(99)=5.82s max=7.82s
      { expected_response:true }...: avg=4.63s min=151.24ms med=4.69s p(90)=5.16s p(95)=5.57s p(99)=5.82s max=7.82s
    http_req_failed................: 0.00%  0 out of 19861
    http_reqs......................: 19861  210.23125/s

    EXECUTION
    iteration_duration.............: avg=4.64s min=163.46ms med=4.69s p(90)=5.16s p(95)=5.57s p(99)=5.83s max=7.82s
    iterations.....................: 19861  210.23125/s
    vus............................: 7      min=7          max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 287 MB 3.0 MB/s
    data_sent......................: 1.6 MB 17 kB/s



running (1m34.5s), 0000/1000 VUs, 19861 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m30s